Revit 2024 API
BuiltInFailures.AutoRouteFailures.DistributionTypeInvalid Property
 Selected distribution system type is invalid!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DistributionTypeInvalid { get; }
Visual Basic
Public Shared ReadOnly Property DistributionTypeInvalid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DistributionTypeInvalid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace